waveshareteam/Waveshare-ESP32-components/bsp/esp32_s3_lr1121_oled_1_54/esp32_s3_lr1121_oled_1_54.c
#include <stdio.h>
#include "esp_lcd_panel_io.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_vfs_fat.h"
#include "esp_spiffs.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "esp_codec_dev_defaults.h"
#include "bsp/esp32_s3_lr1121_oled_1_54.h"
#include "bsp/buttons.h"
#include "bsp_err_check.h"
#include "bsp_err_check.h"

#include "lvgl.h"
#include "esp_lv_adapter.h"

static const char *TAG = "ESP32-S3-LR1121-OLED-1.54";

static bool gpio_initialized = false;

static i2c_bus_handle_t i2c_bus = NULL;
static i2c_master_bus_handle_t i2c_handle = NULL;  // I2C Handle
static bool i2c_initialized = false;

static spi_device_handle_t spi_handle = NULL;// SPI Handle
static bool spi_initialized = false;

static bq27220_handle_t bq27220 = NULL;

sdmmc_card_t *bsp_sdcard = NULL; // Global uSD card handler
temperature_sensor_handle_t temp_sensor = NULL;
static pcf85063a_dev_t dev;

static lv_display_t *disp;
static lv_indev_t *disp_indev = NULL;
static esp_lcd_panel_handle_t panel_handle = NULL;           // LCD panel handle

static i2s_chan_handle_t i2s_tx_chan = NULL;
static i2s_chan_handle_t i2s_rx_chan = NULL;
static const audio_codec_data_if_t *i2s_data_if = NULL; /* Codec data interface */

#define BSP_ES7210_CODEC_ADDR ES7210_CODEC_DEFAULT_ADDR
#define BSP_I2S_GPIO_CFG       \
    {                          \
        .mclk = BSP_I2S_MCLK,  \
        .bclk = BSP_I2S_SCLK,  \
        .ws = BSP_I2S_LCLK,    \
        .dout = BSP_I2S_DOUT,  \
        .din = BSP_I2S_DSIN,   \
        .invert_flags = {      \
            .mclk_inv = false, \
            .bclk_inv = false, \
            .ws_inv = false,   \
        },                     \
    }

#define BSP_I2S_DUPLEX_MONO_CFG(_sample_rate)                                                         \
    {                                                                                                 \
        .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(_sample_rate),                                          \
        .slot_cfg = I2S_STD_PHILIP_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO), \
        .gpio_cfg = BSP_I2S_GPIO_CFG,                                                                 \
    }

/**************************************************************************************************
 *
 * GPIO Function
 *
 **************************************************************************************************/
esp_err_t bsp_gpio_init(void)
{
    // Zero-initialize the GPIO configuration structure
    gpio_config_t io_conf = {};
    io_conf.intr_type = GPIO_INTR_DISABLE; // Disable interrupts for this pin
    io_conf.pin_bit_mask = 1ULL << BSP_POWER_AMP_IO;    // Select the GPIO pin using a bitmask
    io_conf.mode = GPIO_MODE_OUTPUT;          // Set pin as output
    io_conf.pull_up_en = GPIO_PULLUP_DISABLE; // Disable pull-up
    gpio_config(&io_conf); // Apply the configuration

    gpio_initialized = true;

    return ESP_OK;
}

/**************************************************************************************************
 *
 * I2C Function
 *
 **************************************************************************************************/
esp_err_t bsp_i2c_init(void)
{
    /* I2C was initialized before */
    if (i2c_initialized) {
        return ESP_OK;
    }

    i2c_config_t conf = {
        .mode = I2C_MODE_MASTER,
        .sda_io_num = BSP_I2C_SDA,
        .sda_pullup_en = GPIO_PULLUP_ENABLE,
        .scl_io_num = BSP_I2C_SCL,
        .scl_pullup_en = GPIO_PULLUP_ENABLE,
        .master.clk_speed = 400 * 1000,
    };
    i2c_bus = i2c_bus_create(BSP_I2C_NUM, &conf);

    i2c_handle = i2c_bus_get_internal_bus_handle(i2c_bus);

    i2c_initialized = true;

    return ESP_OK;
}

esp_err_t bsp_i2c_deinit(void)
{
    BSP_ERROR_CHECK_RETURN_ERR(i2c_del_master_bus(i2c_handle));
    i2c_initialized = false;
    return ESP_OK;
}

i2c_master_bus_handle_t bsp_i2c_get_handle(void)
{
    bsp_i2c_init();
    return i2c_handle;
}

/**************************************************************************************************
 *
 * SPI Function
 *
 **************************************************************************************************/
esp_err_t bsp_spi_init(void)
{
    /* SPI was initialized before */
    if (spi_initialized) {
        return ESP_OK;
    }

    spi_bus_config_t buscfg = {
        .mosi_io_num = BSP_SPI_MOSI,
        .miso_io_num = BSP_SPI_MISO,
        .sclk_io_num = BSP_SPI_CLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 64,
    };

    spi_device_interface_config_t devcfg = {
        .clock_speed_hz = BSP_SPI_CLK_SPEED_HZ,  // 8 MHz
        .mode = 0,                          // SPI mode 0: CPOL=0, CPHA=0
        .spics_io_num = -1,
        .queue_size = 1,
    };
    // Initialize SPI bus
    ESP_ERROR_CHECK(spi_bus_initialize(BSP_SPI_NUM, &buscfg, SPI_DMA_CH_AUTO));
    ESP_ERROR_CHECK(spi_bus_add_device(BSP_SPI_NUM, &devcfg, &spi_handle));

    spi_initialized = true;

    return ESP_OK;
}

spi_device_handle_t bsp_spi_get_handle(void)
{
    if (spi_handle == NULL)
    {
        bsp_spi_init();
    }
    return spi_handle;
}

/**************************************************************************************************
 *
 * SPIFFS Function
 *
 **************************************************************************************************/
esp_err_t bsp_spiffs_mount(void)
{
    esp_vfs_spiffs_conf_t conf = {
        .base_path = CONFIG_BSP_SPIFFS_MOUNT_POINT,
        .partition_label = CONFIG_BSP_SPIFFS_PARTITION_LABEL,
        .max_files = CONFIG_BSP_SPIFFS_MAX_FILES,
#ifdef CONFIG_BSP_SPIFFS_FORMAT_ON_MOUNT_FAIL
        .format_if_mount_failed = true,
#else
        .format_if_mount_failed = false,
#endif
    };

    esp_err_t ret_val = esp_vfs_spiffs_register(&conf);

    BSP_ERROR_CHECK_RETURN_ERR(ret_val);

    size_t total = 0, used = 0;
    ret_val = esp_spiffs_info(conf.partition_label, &total, &used);
    if (ret_val != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret_val));
    } else {
        ESP_LOGI(TAG, "Partition size: total: %d, used: %d", total, used);
    }

