waveshareteam/Waveshare-ESP32-components/bsp/esp32_s3_lr1121_oled_1_54/esp32_s3_lr1121_oled_1_54.c
    es7210_codec_cfg_t es7210_cfg = {
        .ctrl_if = i2c_ctrl_if,
    };
    es7210_cfg.mic_selected = ES7120_SEL_MIC1 | ES7120_SEL_MIC2 | ES7120_SEL_MIC3 | ES7120_SEL_MIC4;    
    const audio_codec_if_t *es7210_dev = es7210_codec_new(&es7210_cfg);
    BSP_NULL_CHECK(es7210_dev, NULL);

    esp_codec_dev_cfg_t codec_es7210_dev_cfg = {
        .dev_type = ESP_CODEC_DEV_TYPE_IN,
        .codec_if = es7210_dev,
        .data_if = i2s_data_if,
    };
    return esp_codec_dev_new(&codec_es7210_dev_cfg);
}

/**********************************************************************************************************
 *
 * Display Function
 *
 **********************************************************************************************************/
esp_err_t bsp_display_backlight_off(void)
{
    return esp_lcd_panel_disp_on_off(panel_handle, false);
}

esp_err_t bsp_display_backlight_on(void)
{
    return esp_lcd_panel_disp_on_off(panel_handle, true);
}

esp_err_t bsp_display_new(const bsp_display_config_t *config, esp_lcd_panel_handle_t *ret_panel, esp_lcd_panel_io_handle_t *ret_io)
{
    if (!i2c_initialized)
    {
        /* Initilize I2C */
        BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_init());
    }
    ESP_LOGI(TAG, "Install panel IO");
    esp_lcd_panel_io_handle_t io_handle = NULL;

    esp_lcd_panel_io_i2c_config_t io_config = {
        .dev_addr = BSP_OLED_I2C_ADDRESS,
        .scl_speed_hz = 400000,
        .control_phase_bytes = 1,               // According to SSD1306 datasheet
        .lcd_cmd_bits = 8,                      // According to SSD1306 datasheet
        .lcd_param_bits = 8,                    // According to SSD1306 datasheet
        .dc_bit_offset = 6,                     // According to SSD1306 datasheet

    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_handle, &io_config, &io_handle));


    ESP_LOGI(TAG, "Install SSD1309 panel driver");
    esp_lcd_panel_handle_t panel_handle = NULL;
    esp_lcd_panel_dev_config_t panel_config = {
        .bits_per_pixel = 1,
        .reset_gpio_num = BSP_OLED_RST,
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5,0,0))
        .color_space = ESP_LCD_COLOR_SPACE_MONOCHROME,
#endif
    };

    esp_lcd_panel_ssd1309_config_t ssd1309_config = {
        .height = 64,
    };
    panel_config.vendor_config = &ssd1309_config;
    ESP_ERROR_CHECK(esp_lcd_new_panel_ssd1309(io_handle, &panel_config, &panel_handle));

    ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_invert_color(panel_handle,false));
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel_handle, true));

    if (ret_panel) {
        *ret_panel = panel_handle;
    }

    if (ret_io) {
        *ret_io = io_handle;
    }

    return ESP_OK;
}

static lv_display_t *bsp_display_lcd_init(const bsp_display_cfg_t *cfg)
{
    esp_lcd_panel_io_handle_t io_handle = NULL;

    bsp_display_config_t disp_config = { 0 };


    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_new(&disp_config, &panel_handle, &io_handle));

    ESP_LOGI(TAG, "Registering OLED display");
    esp_lv_adapter_display_config_t display_config =  ESP_LV_ADAPTER_DISPLAY_SPI_MONO_DEFAULT_CONFIG(
        panel_handle,           	// LCD panel handle
        io_handle,        			// LCD panel IO handle (can be NULL)
        BSP_LCD_H_RES,             		// Horizontal resolution
        BSP_LCD_V_RES,             	// Vertical resolution
        cfg->rotation, 	// Rotation
        ESP_LV_ADAPTER_MONO_LAYOUT_VTILED 	// Vertical tiled layout
    );
    
    return esp_lv_adapter_register_display(&display_config);
}

static button_handle_t prev_btn_handle = NULL, next_btn_handle = NULL, enter_btn_handle = NULL;
esp_err_t bsp_buttons_new(const bsp_display_cfg_t *cfg, esp_buttons_handle_t *ret_buttons)
{
    const button_gpio_config_t bsp_button_config[] = {
        {
            .gpio_num = BOOT_KEY_GPIO,
            .active_level = 0,
        },
        {
            .gpio_num = MENU_KEY_GPIO,
            .active_level = 0,
        },
        {
            .gpio_num = PTT_KEY_GPIO,
            .active_level = 0,
        },
    };

    const button_config_t btn_cfg = {0};
    /* Create button devices */
    esp_err_t ret = iot_button_new_gpio_device(&btn_cfg, &bsp_button_config[0], &prev_btn_handle);
    if (ret != ESP_OK) {
        return ret;
    }
    ret = iot_button_new_gpio_device(&btn_cfg, &bsp_button_config[1], &next_btn_handle);
    if (ret != ESP_OK) {
        return ret;
    }
    ret = iot_button_new_gpio_device(&btn_cfg, &bsp_button_config[2], &enter_btn_handle);
    
    ESP_LOGI(TAG, "Registering buttons");
    return ret;
}

static lv_indev_t *bsp_display_indev_init(const bsp_display_cfg_t *cfg, lv_display_t *disp)
{
    esp_buttons_handle_t button;
    
    assert(cfg != NULL);
    BSP_ERROR_CHECK_RETURN_NULL(bsp_buttons_new(cfg, &button));
    // assert(button);

    const esp_lv_adapter_nav_buttons_config_t buttons_cfg = {
        .disp = disp,
        .button_prev = prev_btn_handle,
        .button_next = next_btn_handle,
        .button_enter = enter_btn_handle,
    };
    disp_indev = esp_lv_adapter_register_navigation_buttons(&buttons_cfg);
    lv_indev_set_mode(disp_indev, LV_INDEV_MODE_TIMER); 

    return disp_indev;
}

lv_display_t *bsp_display_start(void)
{
    bsp_display_cfg_t cfg = {
        .lv_adapter_cfg = ESP_LV_ADAPTER_DEFAULT_CONFIG(),
        .rotation = ESP_LV_ADAPTER_ROTATE_0,
        .tear_avoid_mode = ESP_LV_ADAPTER_TEAR_AVOID_MODE_DEFAULT,
        .touch_flags = {
            .swap_xy = 0,
            .mirror_x = 0,
            .mirror_y = 0}};

    return bsp_display_start_with_config(&cfg);
}

lv_display_t *bsp_display_start_with_config(const bsp_display_cfg_t *cfg)
{
    BSP_ERROR_CHECK_RETURN_NULL(esp_lv_adapter_init(&cfg->lv_adapter_cfg));

    BSP_NULL_CHECK(disp = bsp_display_lcd_init(cfg), NULL);

    BSP_NULL_CHECK(disp_indev = bsp_display_indev_init(cfg, disp), NULL);
      
    // bsp_display_rotate(disp, LV_DISPLAY_ROTATION_0);
    ESP_ERROR_CHECK(esp_lv_adapter_start());
    return disp;
}

