waveshareteam/Waveshare-ESP32-components/bsp/esp32_s3_lr1121_oled_1_54/esp32_s3_lr1121_oled_1_54.c
lv_indev_t *bsp_display_get_input_dev(void)
{
    return disp_indev;
}

void bsp_display_rotate(lv_display_t *disp, lv_display_rotation_t rotation)
{
    lv_disp_set_rotation(disp, rotation);
}

bool bsp_display_lock(uint32_t timeout_ms)
{
    return esp_lv_adapter_lock(timeout_ms);
}

void bsp_display_unlock(void)
{
    esp_lv_adapter_unlock();
}
/**************************************************************************************************
 *
 * PCF85063A RTC Function
 *
 **************************************************************************************************/
esp_err_t bsp_rtc_init()
{
    if (!i2c_initialized)
    {
        /* Initilize I2C */
        BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_init());
    }
    esp_err_t ret = pcf85063a_init(&dev, i2c_handle, BSP_RTC_I2C_ADDRESS);
    return ret;
}

esp_err_t bsp_set_rtc_time_date(pcf85063a_datetime_t time)
{
    esp_err_t ret = pcf85063a_set_time_date(&dev, time);
    return ret;
}

esp_err_t bsp_set_rtc_alarm_time(pcf85063a_datetime_t time)
{
    esp_err_t ret = pcf85063a_set_alarm(&dev, time);
    return ret;
}

esp_err_t bsp_get_rtc_time_date(pcf85063a_datetime_t *time)
{
    esp_err_t ret = pcf85063a_get_time_date(&dev, time);
    return ret;
}

esp_err_t bsp_get_rtc_alarm_time(pcf85063a_datetime_t *time)
{
    esp_err_t ret = pcf85063a_get_alarm(&dev, time);
    return ret;
}

esp_err_t bsp_enable_rtc_alarm()
{
    esp_err_t ret = pcf85063a_enable_alarm(&dev);
    return ret;
}

esp_err_t bsp_datetime_to_str(char *datetime_str, pcf85063a_datetime_t time)
{
    pcf85063a_datetime_to_str(datetime_str, time);
    return ESP_OK;
}

/**************************************************************************************************
 *
 * BQ27220 BAT Function
 *
 **************************************************************************************************/
esp_err_t bsp_bat_init(uint16_t mah)
{
    if (!i2c_initialized)
    {
        /* Initilize I2C */
        BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_init());
    }
    
    static parameter_cedv_t default_cedv = {
        .full_charge_cap = 650,
        .design_cap = 650,
        .reserve_cap = 0,
        .near_full = 97,
        .self_discharge_rate = 10,
        .EDV0 = 3000,
        .EDV1 = 3150,
        .EDV2 = 3300,
        .EMF = 3750,
        .C0 = 140,
        .R0 = 1200,
        .T0 = 4200,
        .R1 = 5200,
        .TC = 11,
        .C1 = 0,
        .DOD0   = 4200,
        .DOD10  = 4100,
        .DOD20  = 4000,
        .DOD30  = 3920,
        .DOD40  = 3850,
        .DOD50  = 3800,
        .DOD60  = 3750,
        .DOD70  = 3700,
        .DOD80  = 3600,
        .DOD90  = 3400,
        .DOD100 = 3000,
    };
    default_cedv.full_charge_cap = mah;
    default_cedv.design_cap = mah;
    static const gauging_config_t default_config = {
        .CCT = 1,
        .CSYNC = 0,
        .EDV_CMP = 0,
        .SC = 1,
        .FIXED_EDV0 = 0,
        .FCC_LIM = 1,
        .FC_FOR_VDQ = 1,
        .IGNORE_SD = 1,
        .SME0 = 0,
    };

    bq27220_config_t bq27220_cfg = {
        .i2c_bus = i2c_bus,
        .cfg = &default_config,
        .cedv = &default_cedv,
    };

    bq27220 = bq27220_create(&bq27220_cfg);
    return ESP_OK;
}

esp_err_t bsp_get_bat_info(bsp_bat_info_t *bat_info)
{
    bat_info->mv  = bq27220_get_voltage(bq27220);
    bat_info->ma  = bq27220_get_current(bq27220);
    bat_info->mah_rem = bq27220_get_remaining_capacity(bq27220);
    bat_info->mah_fcc = bq27220_get_full_charge_capacity(bq27220);
    bat_info->tc = bq27220_get_temperature(bq27220) / 10 - 273; // Convert from 0.1K to Celsius
    bat_info->cycles = bq27220_get_cycle_count(bq27220);
    bat_info->soc = bq27220_get_state_of_charge(bq27220);
    bat_info->mw = bq27220_get_average_power(bq27220); // in mW
    bat_info->max_load = bq27220_get_maxload_current(bq27220); // in mA
    bat_info->tte = bq27220_get_time_to_empty(bq27220);
    bat_info->ttf = bq27220_get_time_to_full(bq27220);
    bat_info->soh = bq27220_get_state_of_health(bq27220);

    // ESP_LOGI(TAG, "Battery Info - Vol: %dmv, Current: %dmA, Power: %dmW, Remaining Capacity: %dmAh, Full Charge Capacity: %dmAh, Temperature: %dC, Cycle Count: %d, SOC: %d%%, Max Load: %dmA, Time to empty: %dmin, Time to full: %dmin, SOH=%d%%",
    //          bat_info->mv, bat_info->ma, bat_info->mw, bat_info->mah_rem, bat_info->mah_fcc, bat_info->tc, bat_info->cycles, bat_info->soc, bat_info->max_load, bat_info->tte, bat_info->ttf, bat_info->soh);

    return ESP_OK;
}
 /**************************************************************************************************
 *
 * Other Function
 *
 **************************************************************************************************/
esp_err_t bsp_cpu_temp_init()
{
    ESP_LOGI(TAG, "Install temperature sensor, expected temp ranger range: 10~50 ℃");
    temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(20, 50);
    ESP_ERROR_CHECK(temperature_sensor_install(&temp_sensor_config, &temp_sensor));
    
    ESP_LOGI(TAG, "Enable temperature sensor");
    ESP_ERROR_CHECK(temperature_sensor_enable(temp_sensor));

    return ESP_OK;
}

esp_err_t bsp_get_cpu_temp(float *tsens_value)
{
    ESP_LOGI(TAG, "Read temperature");
    ESP_ERROR_CHECK(temperature_sensor_get_celsius(temp_sensor, tsens_value));
    ESP_LOGI(TAG, "Temperature value %.02f ℃", *tsens_value);

    return ESP_OK;
}